import UIKit

class Home: UIViewController {
    let db = DBManage()
    var statement:OpaquePointer? = nil
    
    var checkTimer:Timer?
    
    @IBOutlet weak var clickStrat: UIButton!
    
    override func viewDidLoad() {
        super.viewDidLoad()
        
        clickStrat.isEnabled = false
        
        db.Init()
        db.deleteDataBase()
        db.createDataBase()
        
        if db.openDatabase() {
            // 使用者列表
            _ = db.createTable(sql: "create table userList (iId integer primary key autoincrement not null, uName text not null)")
            
            // 食物類型
            _ = db.createTable(sql: "create table foodType (iId integer primary key autoincrement not null, fName text not null)")
            
            // 冰箱
            _ = db.createTable(sql: "create table iceBox (iId integer primary key autoincrement not null, iName text not null, iType text not null, iAmount text not null, iDate text not null)")
            
            // 食譜列表
            _ = db.createTable(sql: "create table recipeList (iId integer primary key autoincrement not null, rImage text not null, rName text not null, rRequire text not null, rDesc text not null, rLove text not null, rView text not null)")
            
            // 我的食譜
            _ = db.createTable(sql: "create table myRecipe (iId integer primary key autoincrement not null, mName text not null, mRecipe text not null)")
            
            //  檢查“食物類型”是否為空的，若是空的添加“食物類型”資料
            var typeEmpty:Bool = true
            
            statement = db.fetch(table: "foodType", cond: "iId")
            
            while sqlite3_step(statement) == SQLITE_ROW {
                typeEmpty = false
                break;
            }
            
            sqlite3_finalize(statement)
            
            if typeEmpty {
                let data:[String] = ["肉類","蔬菜","魚類","菇類","瓜類","豆類","奶類","水果","飲料","調味品","其他食材"]
                
                for i in data {
                    db.addData(table: "foodType", kv: ["fName", i])
                }
            }
            
            
            
            //  檢查“食譜列表”是否為空的，若是空的添加“食譜列表”資料
            var recipeEmpty:Bool = true
            
            statement = db.fetch(table: "recipeList", cond: "iId")
            
            while sqlite3_step(statement) == SQLITE_ROW {
                recipeEmpty = false
                break;
            }
            
            sqlite3_finalize(statement)
            
            if recipeEmpty {
                let data:[[String]] = [
                    ["大黃瓜貢丸湯", "大黃瓜半條(去籽斜切片),貢丸5顆(切片),芹菜1株(切末),水900ml,調味料,冬菜1大匙,魚露1小匙,胡椒粉1/4匙,米酒1/4匙,香油1小匙", "1,大黃瓜半條，用蘋果刀削去表皮，再把籽切掉後切成片狀、貢丸5顆切片、芹菜切末。調味料備用。2,起一鍋900ml的水，中火，水滾後先下大黃瓜，待大滾後轉小火蓋上鍋蓋，煮5分鐘，這邊是讓大黃瓜煮軟、甜味煮出來。,3,時間到開蓋下貢丸，轉中火，不需加蓋，待水滾。,4,水滾後關火，下冬菜1大匙、魚露1小匙、胡椒粉1/4匙、米酒1/4匙、芹菜末，攪勻。,5,最後淋上香油1小匙即可上桌。,6,此道菜出現在本人馬不停蹄的挑戰100天不重複的假日午餐Part 7: 大黃瓜貢丸湯、櫻花蝦蛋炒飯、炒山蘇"],
                    ["南瓜黃金泡菜", "山東大白菜半顆,南瓜4分之1顆,蒜末1小碗,有機醋100cc,砂糖2大匙,豆腐乳3塊,芝麻醬1大匙,塩1大匙", "1,先將白菜洗淨，滴乾水份後剝大塊，放入容器中(也可利用塑膠袋)灑上1大匙塩巴，充分搖勻，靜置30分鐘後，裝入細紗網，擠乾白菜水份。,2,南瓜切塊先微波5分鐘(或以電鍋蒸熟),再以少許橄欖油略炒。 蒜頭切末約1小碗，芝麻醬(或芝麻油)1大匙，豆腐乳(喜歡辣的可以用辣味)3塊，有機醋100cc(或以檸檬2顆取代),砂糖2大匙。將所有調味料加入炒好的南瓜以攪拌機(果汁機也可)打成泥狀。,3,最後將醬汁和白菜拌勻，裝入容器(最好是密封罐)冷藏保存即可。"],
                    ["焦糖小魚乾花生", "丁香魚乾100克,花生300克,蒜茸1茶匙,椰糖2湯匙,醬油22湯匙,白芝麻(炒香)2茶匙", "1,花生放入滾水汆燙30秒，放筲箕隔去水分，晾乾1小時後放入焗爐以150度焗約20分鐘，其間要把花生翻動一下。之後放涼備用。,2,魚乾下滾水汆燙一下立刻撈起，放乾鍋煸乾，之後下少許香油和白胡椒粉炒香。,3,另一個鍋中，燒熱5湯匙油把小魚乾以中火炒3分鐘，然後炒至金黃，隔去油分。,4,用2茶匙油把蒜茸爆香，加入醬油和椰糖，炒成焦糖漿。,5,下煎好的魚乾兜匀，加入陳醋，再下白芝麻和花生兜勻，完成！"],
                    ["涼拌水晶苦瓜", "苦瓜1條,白芝麻少許,醬汁,檸檬半顆,醬油1大匙,開水5大匙,昆布醬油or柴魚粉or魚露1大匙", "1,先將苦瓜洗淨切片後刨成薄片，加鹽等待出水 如果不喜歡苦瓜的苦澀，可用湯匙把囊的地方刮乾淨些,2,準備一冰水，將步驟1的苦瓜片放入冰鎮,3,醬汁:醬油與冷開水1:5，加入昆布醬油一大匙，以及檸檬汁調勻 分成兩碗，一碗1/3，一碗2/3,4,將步驟2冰鎮過的苦瓜放入2/3醬料的碗中，攪拌均勻後，將醬汁倒掉，盛盤 在淋上1/3碗的醬汁，灑上白芝麻就完成囉~~~ 如果要更入味可以冰在冰箱一晚"],
                    ["涼拌小黃瓜", "小黃瓜300克（3條）,白醋40克,細砂糖40克,蒜頭1小瓣,辣椒0.5根,鹽適量", "1,小黃瓜洗淨後切成小段。,2,切段小黃瓜放入袋中，用刀拍裂。,3,打開袋子，加入1.5小匙鹽巴，用手於袋外搓揉均勻，靜置5-10分鐘，使其出水（口感爽脆關鍵）。,4,靜置黃瓜時，備妥白醋、細砂糖、1小瓣拍碎蒜頭、0.5根辣椒碎末。,5,將袋中黃瓜取出，先置於保鮮盒中（袋中生出的黃瓜水丟棄不要），倒入細砂糖先抓勻。,6,接著加入白醋、蒜頭、辣椒，用手反覆抓匀（約1-2分鐘），可蓋上保鮮盒蓋再搖晃一下使醃漬材料分佈更均勻。（才能平均入味）,7,將小黃瓜放入耐酸容器中，加蓋或用保鮮膜封存，放置冷藏一晚。,8,隔天打開試味道，如果覺得無味，稍加點鹽進去，用手抓勻，並且稍微試一下味道，再冷藏半小時讓小黃瓜更入味後，就可以準備上桌！,9,酸甜清爽好開胃！"],
                    ["黑糖薑茶", "老薑（選用圓胖短的）一大塊,黑糖150g,水適量", "1,老薑刷洗、去除泥土（注意不要刷破皮）後，放入塑膠袋中。,2,用敲肉的金屬棒把薑打裂（若無敲肉的金屬棒，則用其他金屬廚房道具［如：金屬壓蒜器］代替）。,3,把薑移到沾板上，用菜刀切成小塊，然後移至鍋內（阿基師是用一個深的平底鍋）。,4,開小火把薑的表皮煎至微焦。同時另燒一小鍋水（阿基師則是燒一茶壺的水）。,5,滾水倒入薑鍋，水的量需蓋過薑。,6,蓋上鍋蓋煮十分鐘。,7,加入黑糖攪拌至融化。,8,將湯汁濾到一大容器，然後取一玻璃茶壺，裝入1/3的薑，再將全部湯汁倒進去。,9,兌熱水後飲用。（原版阿基師是沒有兌水啦，哈，但我覺得太甜所以兌水）"],
                    ["香蒜奶油干貝", "干貝6顆,蒜1瓣,黑胡椒適量,無鹽奶油一小塊,玫瑰鹽(海鹽及一般鹽巴也可)適量", "1,干貝切米字，蒜切蒜末。,2,熱平底鍋，加入奶油蒜末稍做拌炒至金黃色，放上干貝，灑上黑胡椒，兩面小火稍微煎至金黃色即可。"],
                    ["紅燒川味牛肉", "牛肋條1200g,蔥 (切段)2支,薑片約5-8片,八角5粒,花椒粒1大匙,紅蘿蔔 (切塊)1條,白蘿蔔 (切塊)1條,水約1200cc,調味料,蕃茄醬2大匙,辣豆瓣醬3大匙,醬油適量", "1,將牛肋條洗淨拭乾後切塊，放入滾水中汆燙去除血水雜質，撈起以冷水洗淨。,2,熱油鍋，將蔥段、薑片、花椒粒及八角爆香後取出裝入小棉布袋中。,3,取一乾淨湯鍋，放入作法1與作法2之食材。,4,取作法2原油鍋，將蕃茄醬和辣豆瓣醬爆炒至起泡後，一起放入作法3湯鍋中，並加入紅蘿蔔、白蘿蔔、水燉煮，爐火上加熱至沸騰後改小火，煮約60分鐘，再加醬油調味。,5,※ 紅蘿蔔可增加汁液顏色，白蘿蔔可增加湯汁鮮度。"],
                    ["三杯杏鮑菇(紫蘇口味)", "杏鮑菇5顆,蘑菇5顆,老薑片5片,辣椒1支,九層塔酌量,蒜末一顆", "1,蘑菇切片，杏鮑菇滾刀切大丁，老薑切片，辣椒切末,2,用一湯匙黑麻油先爆香老薑(需扁至香味出來)，加入辣椒與蒜末爆香，加入蘑菇與杏鮑菇，炒至菇類略出水後，再加入一些油續炒,3,加入半碗水，醬油1T，糖1T，悶煮一會使菇類更軟化，起鍋前加入九層塔，拌炒均勻。"],
                    ["花開富貴把把在握", "杏鮑菇300g,蒜末1茶匙,綠花椰1小顆,白花椰1小顆,紅椒1小顆,黃椒1小顆,豌豆莢60g,蒜末2茶匙,水1/2杯,蠔油1.5大匙,米酒1茶匙,糖1/4茶匙,鹽適量,黑胡椒粒少許", "1,將杏鮑菇切滾刀塊；白綠花椰切成小花狀；紅黃椒切片；豌豆莢去絲及蒂頭備用。,2,炒鍋內倒入1茶匙油，放入蒜末爆香後，加入作法1的杏鮑菇及調味料1拌勻，煮至醬汁略收乾。取出杏鮑菇盛盤，放於大圓盤中央。,3,原鍋再倒入1茶匙油，放入蒜末爆香後，加入白綠花椰及水1/2杯(量米杯)，蓋上鍋蓋中火煮至沸騰後，轉小火續煮3分鐘。,4,開蓋加入豌豆莢及紅黃椒，蓋上鍋蓋續煮約2分鐘後，開蓋加入調味料2拌勻，起鍋盛盤放於圓盤周圍即可。"],
                    ["炒海瓜子", "油少許,蒜頭4～5瓣,海瓜子一斤,醬油適量,九層塔一把,烏醋少許", "1,加入油，蒜頭爆香,2,放入海瓜子炒到打開,3,加入醬油拌炒後加九層塔，烏醋即可"],
                    ["橙汁排骨", "排骨12根,大蒜3瓣,蔥3根,薑少許,柳橙2顆,砂糖2大匙,醬油2大匙,米酒2大匙,味醂1小匙,糖1大匙,柳橙汁1/4杯,水", "1,排骨洗淨跑活水去腥味 (排骨放在冷水中加熱至水滾，去掉血水和肉末),2,柳橙榨成汁(我把柳橙切小塊用手持攪拌棒榨汁，沒有攪拌棒直接用叉子刮果肉擠柳橙汁也可)，蒜頭切末，蔥切段，薑切小片,3,不放油熱鍋，放入排骨煎至兩面金黃取出備用,4,原鍋加少許油，放入蒜末、蔥段、薑片爆香,5,香味出來後放入排骨，再加入調味料煮滾，煮滾後轉小火悶煮。若是水沒有淹過排骨，過程中要稍微翻動排骨讓每一側都有浸到滷汁,6,悶煮約一小時後，起另一煎鍋放入砂糖小火炒至融化(如果不容易融化可以考慮先加水將糖溶化，水大約是糖的1/3到1/4份量)，再加入柳橙汁煮滾,7,把排骨從滷汁中撈出放入煎鍋，不斷翻炒讓排骨均勻沾上橙汁，炒至收汁即可"],
                    ["乾煎大蝦", "草蝦(大)6隻,大蒜5顆,番茄醬2匙,辣豆瓣醬1匙,味霖半匙,白醋半匙,米酒2匙", "1,大草蝦去腸泥.剪鬚和腳.蝦頭裡的胃袋要取乾淨避免煮的時候會有蝦的味道.也比較不會髒髒的開背後.再洗淨一次蝦子,2,加少許油.蝦要併排煎.這樣受熱才會均勻兩面煎~,3,煎好利用蝦油炒洋蔥末和蒜頭末,4,接著放入事先調好的醬~番茄醬+辣豆瓣醬+味霖+白醋+米酒,5,到入醬料時.再滴一匙米酒.再放入調味醬快速翻炒,6,完成~"],
                    ["排骨蓮藕湯", "蓮藕中段1節,小排骨300g,乾貨魷魚20g,蒜頭20g,蔥1根,水1000ml,沙拉油(炸魷魚用)100ml,鹽巴1/2匙,胡椒粉1/4匙,米酒", "1,排骨先川燙、蓮藕削皮洗淨切薄片、蔥切段、蒜剝皮(不用拍爛或切碎，要完整的)、魷魚用剪刀剪條狀，以上備用。,2,另起一鍋1000ml的水，水滾後先下蓮藕。,3,煮滾後再下排骨，水滾後轉小火關蓋。,4,這時來準備炸魷魚，取一個小鍋子(我用12cm鍋)，倒進100ml的沙拉油後開中小火，等油溫達180度時，下魷魚炸個10~15秒即馬上撈起加入蓮藕排骨湯裡，小心別炸焦了，變金黃色就可以撈起。然後把魷魚加進湯裡，關蓋持續以小火煮30分鐘。,5,30分鐘後把蒜頭加進去喇一下，關蓋再以小火煮10分鐘。10分鐘到了加蔥段、下調味料。,6,喝一口看看這令人難以忘懷的鮮甜滋味，阿基師的蓮藕排骨湯就完成啦。,7,此道菜出現在本人馬不停蹄的挑戰100天不重複的假日午餐Part 1: 蓮藕排骨湯、涼拌芹菜透抽、烤香魚"],
                    ["南瓜天婦羅", "南瓜100g,糖1小匙,肉桂粉適量,中筋麵粉2大匙,蛋1顆,麵包粉4大匙,葡萄籽油或葵花油適量", "1,先將南瓜洗淨，去籽，切片。灑上糖及肉桂粉，攪拌ㄧ下，靜置10分鐘。,2,起油鍋。另外將南瓜沾上中筋麵粉。,3,再沾上蛋液。,4,再裹上麵包粉。,5,油鍋冒小泡開始，南瓜片放入炸。油量約南瓜體積的3倍。油量少時，可多分幾次炸。兩面金黃時，大火逼油。南瓜夾起，放過濾紙或廚房紙巾上，吸油。,6,好吃的天婦羅又添ㄧ味。^^b,7,同場加映：若是炸帆立貝，需將腸臟清除。灑上鹽巴及胡椒粉調味。也可加蔥薑末及酒，調味更重ㄧ些。,8,重複步驟2～4的步驟，油炸。通常買到的是熟的帆立貝，所以不要炸太久，以金黃上色即可。吸油。,9,超有海味的下酒菜～～^^"],
                    ["茄子熱沙拉", "茄子2條,沙拉油1大匙,檸檬汁1匙,黑胡椒粉適量,鹽1小匙,洋香菜(九層塔)適量", "1,茄子如果挑到不好的，切開裡面都是黑色的籽，就是變老了，口感一點都不好~茄子要挑蒂頭(紅色圈圈處)密合(沒有翹起來)就是好的，切開裡面就白嫩。,2,茄子切約0.6公分的厚度，鍋中放油、兩面煎金黃即可熄火。,3,將調味料拌勻後與煎好茄子混和均勻,4,做過幾次，今天煎的過程接了電話，有點煎過頭， 不要煎太軟比較適合熱沙拉的口感， 雖然是西式做法，但個人覺得加台式九層塔也很對味呢^_^"]
                ]
                
                
                for i in data {
                    db.addData(table: "recipeList", kv: ["rImage", "\(i[0])"], ["rName", "\(i[0])"], ["rRequire", "\(i[1])"], ["rDesc", "\(i[2])"], ["rLove", "0"], ["rView", "0"])
                }
            }
            
            
            
            //  檢查“使用者列表”是否為空的，若是空的執行下方功能
            var userEmpty:Bool = true
            
            statement = db.fetch(table: "userList", cond: "iId")
            
            while sqlite3_step(statement) == SQLITE_ROW {
                userEmpty = false
                
                break;
            }
            
            sqlite3_finalize(statement)
            
            if userEmpty {
                checkTimer = Timer.scheduledTimer(timeInterval: 1.0, target: self, selector: #selector(checkRunTimer), userInfo: nil, repeats: true)
            } else {
                clickStrat.isEnabled = true
            }
            
            db.closeDatabase()
        }
        
    }

    override func didReceiveMemoryWarning() {
        super.didReceiveMemoryWarning()
    }
    
    func checkRunTimer() {
        Login()
        
        checkTimer?.invalidate()
        checkTimer = nil
    }
    
    func Login() {
        let uiAC  = UIAlertController(title: "系統登錄", message: "請輸入用戶名稱", preferredStyle: .alert)
        let uiBtn = UIAlertAction(title: "登錄", style: UIAlertActionStyle.default) { (UIAlertAction) in
            let uiText = (uiAC.textFields?.first)! as UITextField
            
            if uiText.text!.isEmpty {
                self.Login()
                return
            }
            
            self.db.Init()
            
            if self.db.openDatabase() {
                self.db.addData(table: "userList", kv: ["uName", uiText.text!])
                
                self.clickStrat.isEnabled = true
            }
            
            self.db.closeDatabase()
        }
        
        uiAC.addTextField { (UITextField) in
            UITextField.placeholder = "使用者名稱"
        }
        uiAC.addAction(uiBtn)
        self.present(uiAC, animated: true, completion: nil)
    }
}
